Обработки/Reports/_ОтчетПоЗапросуЦБСДолями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоЗапросуЦБСДолями</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьШапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляОтВыпускаВПроцентах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоЗапросуЦБСДолями/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет для Нефтегаранта",
		"1.20",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	РаботаСОтчетами.КонтрольВалютыРасходовПоСделкамОтличнойОтВалютыУчета(ЭтотОбъект.СчетДоверительногоУправления, , КонецДня(ЭтотОбъект.Период));
	
	Настройки = КомпоновщикНастроек.Настройки;

	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Биржа", 			ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 	ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", 		Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Дата", 			ЭтотОбъект.Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЭтоБалансоваяСтоимость", ЭтотОбъект.ВариантРасчета = "Баланс");
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДоляОтВыпускаВПроцентах", ЭтотОбъект.ДоляОтВыпускаВПроцентах);
			
	МассивСубконтоКонтрагентыОснованиеРасчетов = Новый Массив;
	МассивСубконтоКонтрагентыОснованиеРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	МассивСубконтоКонтрагентыОснованиеРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	СубконтоКонтрагентыДоговоры = Новый Массив;
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СубконтоДепозиты", ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СубконтоУсловияДепозитов", ПланыВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов);

	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СубконтоКонтрагентыДоговоры", СубконтоКонтрагентыДоговоры);
	
	ПараметрыШапки = ПолучитьПараметрыШапки();

	Если ПараметрыШапки.ДатаЛицензииНПФ = NULL ИЛИ ПараметрыШапки.ДатаЛицензииНПФ = '00010101' Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильно заполнены лицензии клиента!");
		Возврат;
	
	КонецЕсли;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеФонда", 				 ПараметрыШапки.НаименованиеФонда + Формат(ПараметрыШапки.ДатаЛицензииНПФ, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеУправляющейКомпании", ПараметрыШапки.НаименованиеУправляющейКомпании + Формат(ПараметрыШапки.ДатаЛицензииУК, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора", 					 ПараметрыШапки.НомерДоговора + " от " + Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидСредств", 				 	 ПараметрыШапки.ВидСредств);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ПараметрыВыводаПодписей);

КонецПроцедуры

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидСредств
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу + "", №"" + СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Серия + "" "" + СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Номер + "" от "" КАК НаименованиеУправляющейКомпании,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	ЕСТЬNULL(ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") + "", №"" + СтатусыЛицензийСрезПоследних.Лицензия.Серия + "" "" + СтатусыЛицензийСрезПоследних.Лицензия.Номер + "" от "", """") КАК НаименованиеФонда,
		|	ЕСТЬNULL(СтатусыЛицензийСрезПоследних.Лицензия.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЛицензииНПФ,
		|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаЛицензииУК,
		|	_КлиентДоверительногоУправления.ВидСредств КАК ВидСредств
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|				&Период,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|					И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ)) КАК СтатусыЛицензийОрганизацииСрезПоследних
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ЮрФизЛицо,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|				&Период,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|					И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоПенсионномуСтрахованию)) КАК СтатусыЛицензийСрезПоследних
		|		ПО _КлиентДоверительногоУправления.Клиент = СтатусыЛицензийСрезПоследних.Лицензия.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции
